# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [47]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Info on Unique Values

In [2]:
df['col2'].unique()  # ===>> SELECT DISTINCT(col2) FROM df

array([444, 555, 666])

In [3]:
df['col2'].nunique()  # ===>> SELECT COUNT(DISTINCT(col2)) FROM df

3

In [11]:
df['col2'].value_counts() # ===> SELECT COUNT(*), COL2 FROM DF GROUPBY COL2

444    2
555    1
666    1
Name: col2, dtype: int64

### Selecting Data

In [7]:
(df['col1']>2) & (df['col2']==444)

0    False
1    False
2    False
3     True
dtype: bool

In [9]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)] # ===>> SELECT * from df where conditions

In [10]:
newdf

   col1  col2 col3
3     4   444  xyz

### Applying Functions

In [12]:
df['col1']

0    1
1    2
2    3
3    1
Name: col1, dtype: int64

In [14]:
def times2(x):
    return x*2

In [15]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    2
Name: col1, dtype: int64

In [16]:
df['col2'].apply(lambda x: x**0.5)

0    21.071308
1    23.558438
2    25.806976
3    21.071308
Name: col2, dtype: float64

In [19]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [20]:
df['col1'].sum()

7

** Permanently Removing a Column**

In [21]:
del df['col1']

In [22]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  abc

** Get column and index names: **

In [23]:
df.shape

(4, 2)

In [24]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [26]:
df.index.tolist()

[0, 1, 2, 3]

** Sorting and Ordering a DataFrame:**

In [28]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     1   444  abc

In [33]:
df.sort_values(by=['col2','col3'],ascending=[False,True]) #inplace=False by default

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

** Find Null Values or Check for Null Values**

In [34]:
df.isnull() # df.isna()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [35]:
# Drop rows with NaN Values
df.dropna()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

** Filling in NaN values with something else: **

In [36]:
import numpy as np

In [37]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [39]:
df.isnull()

    col1   col2   col3
0  False   True  False
1  False  False  False
2  False  False  False
3   True  False  False

In [40]:
df.dropna()

   col1   col2 col3
1   2.0  555.0  def
2   3.0  666.0  ghi

In [42]:
df.fillna("Missing")

      col1     col2 col3
0        1  Missing  abc
1        2      555  def
2        3      666  ghi
3  Missing      444  xyz

In [48]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [49]:
df.drop_duplicates(subset=['col2'])

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi